<?php

$retry = 'الرجاء المحاولة مرة أخرى.';

return [
    'errors' => [
        'item-not-found' => 'فشلت العملية، لم يتم العثور على :attribute',
        'general' => 'فشلت العملية، '.$retry,
        'create' => 'فشلت عملية الإضافة، '.$retry,
        'update' => 'فشلت عملية التعديل، '.$retry,
        'delete' => 'فشلت عملية التعديل، '.$retry,
        'duplicated-email' => 'البريد الإلكتروني موجود مسبقاً.',
        'no-record-selected' => 'لم يتم تحديد أي سجل لجلبه.',
        'import-partially-failed' => 'تعزر حفظ بعض البيانات الرجاء مراجعة البيانات التي تم إستيرادها.'
    ],
    'success' => [
        'general' => 'تمت العملية بنجاح.',
        'create' => 'تمت عملية الإضافة بنجاح.',
        'update' => 'تمت عملية التعديل بنجاح.',
        'delete' => 'تمت عملية الحذف بنجاح.',
        'import-records' => 'تم جلب السجلات بنجاح.',
        'downloads' => [
            'downloading-file' => 'جاري تنزيل الملف...'
        ]
    ],
    'companies' => [
        'company-not-empty' => 'لا يمكن حذف الشركة، يجب أولاً تفريغ الشركة من كل المستندات التي تم إضافتها مسبقاَ.',
        'company-not-found' => 'فشلت العملية، لم يتم التعرف على الشركة المراد حذفها. حاول مرة أخرى.',
    ]
];
